espressif/esp-idf/components/esp32/include/soc/uart_struct.h
            volatile uint32_t rs485tx_rx_en:    1;           /*Set this bit to enable loop-back transmitter's output data signal to receiver's input data signal.*/
            volatile uint32_t rs485rxby_tx_en:  1;           /*1: enable rs485's transmitter to send data when rs485's receiver is busy. 0:rs485's transmitter should not send data when its receiver is busy.*/
            volatile uint32_t rs485_rx_dly_num: 1;           /*This register is used to delay the receiver's internal data signal.*/
            volatile uint32_t rs485_tx_dly_num: 4;           /*This register is used to delay the transmitter's internal data signal.*/
            volatile uint32_t reserved10:      22;
        };
        volatile uint32_t val;
    }rs485_conf;
    union {
        struct {
            volatile uint32_t pre_idle_num:24;               /*This register is used to configure the idle duration time before the first at_cmd is received by receiver， when the the duration is less than this register value it will not take the next data received as at_cmd char.*/
            volatile uint32_t reserved24:   8;
        };
        volatile uint32_t val;
    }at_cmd_precnt;
    union {
        struct {
            volatile uint32_t post_idle_num:24;              /*This register is used to configure the duration time between the last at_cmd and the next data， when the duration is less than this register value  it will not take the previous data as at_cmd char.*/
            volatile uint32_t reserved24:    8;
        };
        volatile uint32_t val;
    }at_cmd_postcnt;
    union {
        struct {
            volatile uint32_t rx_gap_tout:24;                /*This register is used to configure the duration time between the at_cmd chars， when the duration time is less than this register value it will not take the data as continous at_cmd chars.*/
            volatile uint32_t reserved24:  8;
        };
        volatile uint32_t val;
    }at_cmd_gaptout;
    union {
        struct {
            volatile uint32_t at_cmd_char: 8;                /*This register is used to configure the content of at_cmd char.*/
            volatile uint32_t char_num:    8;                /*This register is used to configure the number of continuous at_cmd chars received by receiver.*/
            volatile uint32_t reserved16: 16;
        };
        volatile uint32_t val;
    }at_cmd_char;
    union {
        struct {
            volatile uint32_t mem_pd:             1;         /*Set this bit to power down memory，when reg_mem_pd registers in the 3 uarts are all set to 1  memory will enter low power mode.*/
            volatile uint32_t reserved1:          1;
            volatile uint32_t reserved2:          1;
            volatile uint32_t rx_size:            4;         /*This register is used to configure the amount of mem allocated to receiver's fifo. the default byte num is 128.*/
            volatile uint32_t tx_size:            4;         /*This register is used to configure the amount of mem allocated to transmitter's fifo.the default byte num is 128.*/
            volatile uint32_t reserved11:         4;
            volatile uint32_t rx_flow_thrhd_h3:   3;         /*refer to the rx_flow_thrhd's description.*/
            volatile uint32_t rx_tout_thrhd_h3:   3;         /*refer to the rx_tout_thrhd's description.*/
            volatile uint32_t xon_threshold_h2:   2;         /*refer to the uart_xon_threshold's description.*/
            volatile uint32_t xoff_threshold_h2:  2;         /*refer to the uart_xoff_threshold's description.*/
            volatile uint32_t rx_mem_full_thrhd:  3;         /*refer to the rxfifo_full_thrhd's description.*/
            volatile uint32_t tx_mem_empty_thrhd: 3;         /*refer to txfifo_empty_thrhd 's description.*/
            volatile uint32_t reserved31:         1;
        };
        volatile uint32_t val;
    }mem_conf;
    union {
        struct {
            volatile uint32_t mem_tx_status:24;
            volatile uint32_t reserved24:    8;
        };
        volatile uint32_t val;
    }mem_tx_status;
    union {
        struct {
            volatile uint32_t mem_rx_status:24;
            volatile uint32_t reserved24:    8;
        };
        volatile uint32_t val;
    }mem_rx_status;
    union {
        struct {
            volatile uint32_t rx_mem_cnt: 3;                 /*refer to the rxfifo_cnt's description.*/
            volatile uint32_t tx_mem_cnt: 3;                 /*refer to the txfifo_cnt's description.*/
            volatile uint32_t reserved6: 26;
        };
        volatile uint32_t val;
    }mem_cnt_status;
    union {
        struct {
            volatile uint32_t posedge_min_cnt:20;            /*This register stores the count of rxd pos-edge edge， it is used in baudrate-detect process.*/
            volatile uint32_t reserved20:     12;
        };
        volatile uint32_t val;
    }pospulse;
    union {
        struct {
            volatile uint32_t negedge_min_cnt:20;            /*This register stores the count of rxd neg-edge edge， it is used in baudrate-detect process.*/
            volatile uint32_t reserved20:     12;
        };
        volatile uint32_t val;
    }negpulse;
    volatile uint32_t reserved_70;
    volatile uint32_t reserved_74;
    volatile uint32_t date;                                  /**/
    volatile uint32_t id;                                    /**/
} uart_dev_t;
extern volatile uart_dev_t UART0;
extern volatile uart_dev_t UART1;
extern volatile uart_dev_t UART2;
#endif  /* _SOC_UART_STRUCT_H_ */
